# The AIR_10 WHO Dataset contains Ambient air pollution attributable DALYs (Disability Adjusted Life Years) per 100,000 children under 5 years

Children were 5 years or younger in 2004, Data was calculated and reported in 2013

This data measures the effect of air pollution outside of the household on infants and toddlers through Disability Adjusted Life Years, which is defined by the WHO as "(representing) the loss of the equivalent of one year of full health. DALYs for a disease or health condition are the sum of the years of life lost to due to premature mortality (YLLs) and the years lived with a disability (YLDs) due to prevalent cases of the disease or health condition in a population.".

In [ ]:
import pandas as pd

In [62]:
AIR_10 = pd.read_json("AIR_10.json")

In [63]:
AIR_10_dicts = AIR_10.value

In [64]:
df = pd.DataFrame.from_records(AIR_10_dicts)

In [65]:
# Cleaning Steps
df.drop(['IndicatorCode','SpatialDimType','TimeDimType','Dim1Type','Dim2Type','Dim3Type','DataSourceDim','Dim1','Dim2','Dim3',\
        'DataSourceDimType','Low','High','Comments','TimeDimensionValue','TimeDimensionBegin','TimeDimensionEnd','Value','Id',\
         'TimeDim','Date'], axis = 1, inplace=True)
df.rename(columns = {'SpatialDim':'country','NumericValue':'value'}, inplace=True)
df

    country    value
0       AFG   137.60
1       ALB     5.76
2       DZA    46.06
3       AND     1.09
4       AGO  1321.84
..      ...      ...
168     VEN     0.44
169     VNM    21.01
170     YEM   177.44
171     ZMB   418.14
172     ZWE    89.19

[173 rows x 2 columns]

In [67]:
mean_DALY = df.value.mean()
mean_DALY

105.2213294797688

In [69]:
std_DALY = df.value.std()
std_DALY

211.05531796072157

In [77]:
max_DALY = df[df.value == df.value.max()].dropna()
max_DALY

   country    value
78     IRQ  1539.58

In [79]:
min_DALY = df[df.value == df.value.min()].dropna()
min_DALY

    country  value
14      BRB    0.0
15      BLR    0.0
17      BLZ    0.0
19      BTN    0.0
54      GNQ    0.0
61      GAB    0.0
70      GUY    0.0
79      IRL    0.0
96      LUX    0.0
120     PNG    0.0
132     KNA    0.0
146     SUR    0.0
167     VUT    0.0